#include <stdio.h>

int main()
{
	//שיניתי את ההזחה כי היא הייתה לא טובה
	//שיניתי את המשתנה מדיפיין לקונסט כי היחס כל הזמן משתנה והוא לא קבוע, והבוסף שיניתי את שם המשתנה לשם בעל משמעות
	const float ILS_TO_DIR_RATIO = 1.0873;
	//שיניתי את שם המשתנה לשם בעל משמעות כי לא הייתה לו
	int shekels = 0;
	printf("Welcome to United Arab Emirates, how many ILS you have?\n");
	//שיניתי את הסימן של הדולר לאמפרסנד כי האמפרסנד אומר לזיכרון של איזה משתנה לגשת והדולר יצור שגיאת קומפילציה, ושיניתי את שם המשתנה לשמו החדש
	scanf("%d", &shekels);
	/* 
	שיניתי את השם של הקונסט לשמו החדש
	שיניתי את השם שלל המשתנה איקס לשמו החדש
	*/
	printf("You have %.2f Dirham\n", ILS_TO_DIR_RATIO*shekels);
	
	return 0;
}
